ch570512/Qlockwork/src/main.cpp
//=============================================================================
// Loop()
//=============================================================================

void loop()
{
    // Call HTTP-handle
#ifdef WEBSERVER
    webServer.handleClient();
#endif

    // Call OTA-handle
#ifdef ARDUINO_OTA
    ArduinoOTA.handle();
#endif

    // Get the time from ESP
    struct tm tmNow = getTime();

    //=============================================================================
    // Run once a day
    //=============================================================================

    if (tmNow.tm_mday != lastDay)
    {
        lastDay = tmNow.tm_mday;
        screenBufferNeedsUpdate = true;

#ifdef SHOW_MODE_MOONPHASE
        moonphase = getMoonphase(tmNow.tm_year, tmNow.tm_mon, tmNow.tm_mday);
#endif

        // Reset URL event 0
        events[0].day = 0;
        events[0].month = 0;

        // Change color
        if (settings.mySettings.colorChange == COLORCHANGE_DAY)
        {
            settings.mySettings.color = random(0, COLORCHANGE_COUNT + 1);
#ifdef DEBUG
            Serial.printf("Color changed to: %u\n", settings.mySettings.color);
#endif
        }
    }

    //=============================================================================
    // Run once every hour
    //=============================================================================

    if (tmNow.tm_hour != lastHour)
    {
        lastHour = tmNow.tm_hour;
        screenBufferNeedsUpdate = true;

        // Change color
        if (settings.mySettings.colorChange == COLORCHANGE_HOUR)
        {
            settings.mySettings.color = random(0, COLOR_COUNT + 1);
#ifdef DEBUG
            Serial.printf("Color changed to: %u\n", (int)settings.mySettings.color);
#endif
        }

        // Hourly beep
#ifdef BUZZER
        if ((settings.mySettings.hourBeep == true) && (mode == MODE_TIME))
        {
            digitalWrite(PIN_BUZZER, HIGH);
            delay(25);
            digitalWrite(PIN_BUZZER, LOW);
            DEBUG_SERIAL_PRINTLN("Beep!");
        }
#endif

        //=============================================================================
        // Run once every random hour (therefore once a day)
        //=============================================================================

        if (tmNow.tm_hour == randomHour)
        {
        }
    }

    //=============================================================================
    // Run once every minute
    //=============================================================================

    if (tmNow.tm_min != lastMinute)
    {
        lastMinute = tmNow.tm_min;
        screenBufferNeedsUpdate = true;

#ifdef DEBUG
        Serial.printf("\nTime (ESP): %02d:%02d:%02d %02d.%02d.%02d\n", tmNow.tm_hour, tmNow.tm_min, tmNow.tm_sec, tmNow.tm_mday, tmNow.tm_mon + 1, tmNow.tm_year + 1900);
#endif

#if defined(SENSOR_DHT22)
        // Update room conditions
        getRoomConditions();
#endif

#ifdef BUZZER
        // Switch on buzzer for alarm 1
        if (settings.mySettings.alarm1 && (tmNow.tm_hour == getHour(settings.mySettings.alarm1Time)) && (tmNow.tm_min == getMinute(settings.mySettings.alarm1Time)) && bitRead(settings.mySettings.alarm1Weekdays, tmNow.tm_wday))
        {
            alarmOn = BUZZTIME_ALARM_1;
            DEBUG_SERIAL_PRINTLN(F("Alarm1 on"));
        }

        // Switch on buzzer for alarm 2
        if (settings.mySettings.alarm2 && (tmNow.tm_hour == getHour(settings.mySettings.alarm2Time)) && (tmNow.tm_min == getMinute(settings.mySettings.alarm1Time)) && bitRead(settings.mySettings.alarm2Weekdays, tmNow.tm_wday))
        {
            alarmOn = BUZZTIME_ALARM_2;
            DEBUG_SERIAL_PRINTLN(F("Alarm2 on"));
        }
#endif

        // Set night- and daymode
        if ((tmNow.tm_hour == getHour(settings.mySettings.nightOffTime)) && (tmNow.tm_min == getMinute(settings.mySettings.nightOffTime)))
        {
            DEBUG_SERIAL_PRINTLN(F("Night off"));
            setMode(MODE_BLANK);
        }
        if ((tmNow.tm_hour == getHour(settings.mySettings.dayOnTime)) && (tmNow.tm_min == getMinute(settings.mySettings.dayOnTime)))
        {
            DEBUG_SERIAL_PRINTLN(F("Day on"));
            setMode(lastMode);
        }

        //=============================================================================
        // Run once every random minute (once an hour)
        //=============================================================================

        if (tmNow.tm_min == randomMinute)
        {
            if (WiFi.isConnected())
            {
                // Get weather from MeteoWeather
#ifdef WEATHER
                !outdoorWeather.getOutdoorConditions(LATITUDE, LONGITUDE, TIMEZONE) ? errorCounterOutdoorWeather++ : errorCounterOutdoorWeather = 0;
                DEBUG_SERIAL_PRINT(F("Outdoor temperature: "));
                DEBUG_SERIAL_PRINT(outdoorWeather.temperature);
                DEBUG_SERIAL_PRINTLN(F(" °C"));
                DEBUG_SERIAL_PRINT(F("Outdoor humidity: "));
                DEBUG_SERIAL_PRINT(outdoorWeather.humidity);
                DEBUG_SERIAL_PRINTLN(F(" %rH"));
#endif
            }
        }

        //=============================================================================
        // Run once every 5 minutes
        //=============================================================================

        if (tmNow.tm_min % 5 == 0)
        {
            // Change color
            if (settings.mySettings.colorChange == COLORCHANGE_FIVE)
            {
                settings.mySettings.color = random(0, COLOR_COUNT + 1);
#ifdef DEBUG
                Serial.printf("Color changed to: %u\n", settings.mySettings.color);
#endif
            }
        }
    }

    //=============================================================================
    // Run once every second
    //=============================================================================

